app/views/static_pages/_location.html.erb

SELECT  `locations`.* FROM `locations` LIMIT 3
---
      <%= image_tag location.pictures[Settings.static_pages.location.number_of_pictures].url ,class: "d-block w-100" if
      location.pictures.length > Settings.static_pages.location.number_of_pictures %>

SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`location_id` = 1
---
      <p>
        <%= t ".view_on_map" %>   |   <%= location.reviews.count %>  <%= t ".reviews" %>