app/controllers/static_pages_controller.rb

  def home
    @search = Location.ransack params[:q]
    @locations = @search.result.group(:id).includes(:location_type, :rooms).page(params[:page]).per Settings.controllers.static_pages.limit_location
    @location_types = LocationType.order(:name)
      .page(params[:page]).per Settings.controllers.admin.location_types.pag
---
SELECT  `locations`.* FROM `locations` LIMIT 3
SELECT  `location_types`.* FROM `location_types` ORDER BY `location_types`.`name` ASC LIMIT 10 OFFSET 0